<?php
header("Content-Type: text/html;charset=utf-8");
    ?>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<?php

// основные операторы
// оператор присваивания "="
$fristName = "имя";
$lastName = "фамилия";
$fullName = $fristName . $lastName;  //оператор конкатенации
$fullName = $fristName . " - " . $lastName;  // изменили выводы. Почему выводится 1 раз?
echo $fullName;

//условные операторы
//if
/*
 * Оператор if состоит из условия и одного или нескольких операторов, сгруппированных в виде блока. 
 * Если интерпретатор РНР оценивает выражение как правильное, то он выполняет блок операторов. 
 * Если условие ложно, то данный блок будет пропущен. 
 * В приведенном ниже примере интерпретатор РНР сравнивает значение переменных $a и $b.   
 * Если они равны, то он выводит, на экран строку "А = В"
 */

echo '<br> ==================================================== <br>';
        $a = 5;
$b = 6;
if ($a == $b) {
    echo 'А равно В';
} else {
    echo 'А не равно В';    
}


//оператор elseif
echo '<br> ==================================================== <br>';
$a = 4;
$b = 6;
$c = 10;
$d = 5;
if ($a == $b) {
    echo 'А равно В';
} elseif ($a == $c) {
echo 'А равно C';
} 
 elseif ($a == $d) {
echo 'А равно D';
}   
else{
echo 'А ничему не равно';
} 


echo '<br> ==================================================== <br>';
//оператор switch
$a = 5;
$b = 6;
$c = 10;
$d = 5;
switch ($a) {
case $b:
    echo 'А равно В';
    break;
    case $c:
        echo 'А равно C';
        break;
        case $d:
            echo 'А равно D';
            break;
        default:
            echo 'А ничему не равно';
            break;
}

//циклы
// for
echo '<br> ==================================================== <br>';
for ($i = 1; $i < 101; $i = $i + 1) {
    echo $i . '<br>';
}

// while
echo '<br> ==================================================== <br>';
$i = 1;
while ($i < 101) {
    echo $i . '<br>';
    $i = $i + 1;
}

// foreach
echo '<br> ==================================================== <br>';
$myArray = array('Привет', 'Мир', 'родился', 'новый', 'программист');
foreach ($myArray as $value) {
    echo $value . '<br>';
}